namespace ProtectionTools.Core.FSharp

module ReceiversGroup = 
    [<Measure>] type ``В``
    [<Measure>] type ``кВт``

    let sqr x = x * x
    let sqrt3 = sqrt 3.0

    let CalculatedActivePower коэффициент_расчётной_мощности коэффициент_использования (номинальная_мощность_приемника: float<кВт>) (количество: int) = 
        коэффициент_расчётной_мощности * коэффициент_использования * номинальная_мощность_приемника * (float количество)

    let ActivePowerCoef количество_приемников =
        if количество_приемников <= 10 then
            1.1
        else
            1.0

    let Мощность_потребителя коэффициент_использования (номинальная_мощность: float<кВт>) тангенс_ф = 
        коэффициент_использования * номинальная_мощность * тангенс_ф
            
    let CalculatedReactivePower (коэффициент_расчетной_мощности) (список_потребителей: List<float<кВт>>)  =            
        (список_потребителей |> List.sum) * коэффициент_расчетной_мощности

    let CalculatedFullPower (активная_мощность: float<кВт>) (реактивная_мощность: float<кВт>) = 
        sqrt (sqr активная_мощность + sqr реактивная_мощность)
        
    let CalculatedCurrent (полная_расчетная_мощность: float<кВт>) (номинальное_напряжение: float<В>) = 
        полная_расчетная_мощность / (sqrt3 * номинальное_напряжение)